# [프로그래머스]-파이썬-연습-(양꼬치)-LV0-(1-내풀이-정답).py
# https://github.com/irishNoah/Algorithm-Study
# https://school.programmers.co.kr/learn/courses/30/lessons/120830

'''
*** 제한 > 시간 : ?초 (기본 1초) / 메모리 : ?MB (기본 128MB)


*** 조건
>>> 0 < n < 1,000
>>>  n / 10 ≤ k < 1,000
>>> 서비스로 받은 음료수는 모두 마십니다.

* 설계 [총 1분 소요] / 총 풀이 시간[총 4분 소요]
-

'''
#===================================================================================

def solution(n, k):

    return 12000*n + (k - n//10)*2000


# #############################################################

n = 64
k = 6
print(solution(n, k)) # 124,000